АлогистикТест2/src/Documents/алк_ПересортицаНоменклатуры/алк_ПересортицаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПересортицаНоменклатуры</name>
  <basedOn>Document.алк_ПриемкаЛесопродукции</basedOn>
  <registerRecords>AccumulationRegister.алк_УчетЛесопродукцииНаОтветхранении</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      <types>DocumentRef.алк_ВозвратОтветхранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэфПересортицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>EnumRef.алк_ВидыРегистровИнвентаризации</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапасыРасход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапасыПриход</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штабель</name>
      <type>
        <types>CatalogRef.Ячейки</types>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.алк_ПриемкаЛесопродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияТД</name>
      <type>
        <types>DocumentRef.рфп_ОтгрузкаВагона</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПроизводства</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Остатки</name>
  </enumValues>
  <enumValues>
    <name>Произведено</name>
  </enumValues>
  <enumValues>
    <name>Подано</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
    <comment>Упаковано объема</comment>
  </enumValues>
  <enumValues>
    <name>Выход</name>
  </enumValues>
  <enumValues>
    <name>УпакованоШтук</name>
    <comment>Упаковано штук пакетов</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование1</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование2</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование3</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеНаКотельную</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырья</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЕль</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЛиственница</name>
  </enumValues>
  <enumValues>
    <name>КРСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>КРСОбщий</name>
  </enumValues>
  <enumValues>
    <name>ОстатокВСилосе</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяВсего</name>
  </enumValues>
  <enumValues>
    <name>ГранулированиеСреднее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКора</name>
  </enumValues>
  <enumValues>
    <name>ПоступилоНаБиржу</name>
    <comment>ВходящийТранспорт. Привезли еще не разгружался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСобственнымиСилами</name>
    <comment>ВходящийТранспортРазгрузили еще не сортировался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСиламиПодрядчика</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСырьяПослеДробления</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыРегистровИнвентаризации/алк_ВидыРегистровИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыРегистровИнвентаризации</name>
  <enumValues>
    <name>ЗапасыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>УчетЛесопродукцииНаОтветхранении</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>УчетЛесопродукцииГОСТ</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПересортицаНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ДатаСмены,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Смена,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель КАК Ячейка,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Партия,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.ПартияТД,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Контрагент
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.ДатаСмены,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Смена,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Объем,
		|	&ВидДвиженияРасход,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Партия,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.ПартияТД,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Контрагент
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыРасход КАК алк_ПересортицаНоменклатурыЗапасыРасход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Поступление) КАК операция,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель,
		|	ВЫБОР
		|		КОГДА алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидырегистровИнвентаризации.ЗапасыОрганизации)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Ответхранение
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|	И алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидыРегистровИнвентаризации.ЗапасыОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель КАК Ячейка,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель,
		|	ВЫБОР
		|		КОГДА алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Ответхранение
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Объем,
		|	&ВидДвиженияРасход,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	ВЫБОР
		|		КОГДА алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыРасход КАК алк_ПересортицаНоменклатурыЗапасыРасход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПересортицаНоменклатуры.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПересортицаНоменклатуры);			
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетОтветхранения", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[2].Выгрузить());
		
		СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатуры.Ссылка.Организация КАК Организация,
		|	&Период,
		|	алк_ПересортицаНоменклатуры.Ссылка.ДатаСмены КАК ДатаСмены,
		|	алк_ПересортицаНоменклатуры.Ссылка.Смена КАК Смена,
		|	0 КАК МоментПроведения,
		|	&Сотрудник
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры КАК алк_ПересортицаНоменклатуры
		|ГДЕ
		|	алк_ПересортицаНоменклатуры.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПересортицаНоменклатуры.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПересортицаНоменклатуры);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тРезультат = МассивРезультатов[0].Выгрузить();
		
		Для каждого стр Из тРезультат Цикл
			
			стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЦикла; 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослБиржа", тРезультат);
		
		
	КонецПроцедуры // СформироватьТаблицаДокументыПослБиржа
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
	Процедура СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Дата КАК Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель КАК Штабель
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|	И алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура.Код = ""ПБ-00000002""
		|	И &ДатаНачалаУчетаЗаполнена
		|	И алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Дата > &ДатаНачалаУчетаШпона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Объем,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Дата,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыРасход КАК алк_ПересортицаНоменклатурыЗапасыРасход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка = &Ссылка
		|	И алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура.Код = ""ПБ-00000002""
		|	И &ДатаНачалаУчетаЗаполнена
		|	И алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Дата > &ДатаНачалаУчетаШпона";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПересортицаНоменклатуры);
		Запрос.УстановитьПараметр("ДатаНачалаУчетаЗаполнена", ЗначениеЗаполнено(Константы.алк_ДатаНачалаУчетаШпона.Получить()));
		Запрос.УстановитьПараметр("ДатаНачалаУчетаШпона", Константы.алк_ДатаНачалаУчетаШпона.Получить());
		
		МассивРезультатов = Запрос.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов.Выгрузить());
		
	КонецПроцедуры // СформироватьТаблицаОстаткиЗапасов

	#КонецОбласти 
	
#КонецЕсли
